src/Documents/ИТ_УстановкаПланаПродаж_СтаршийМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИТ_УстановкаПланаПродаж_СтаршийМенеджер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИТ_ПланПродаж_День</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтаршийМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИТ_УстановкаПланаПродаж_Месяц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиНаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_11</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_12</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_13</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_14</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_15</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_16</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_17</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_18</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_19</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_20</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_21</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_22</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_23</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_24</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_25</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_26</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_27</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_28</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_29</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_30</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_31</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРаспределения</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФактПрошлыйГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ИТ_СтатусыПлановПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИТ_СтатусыПлановПродаж</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИТ_УстановкаПланаПродаж_СтаршийМенеджер/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.КоманднаяПанельПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	// Обновление данных
	ОбновитьДанныеПериодаПрошлогоГода();
	ОбновитьПоДаннымРаспределенияСервер();
	ОбновитьПраваДоступа();
	
	// Визуальное оформление
	ОбновитьОтображениеДнейИНедель();
	
	Если ЗначениеЗаполнено(Объект.ПериодПлана) Тогда 
		ОбновитьОтображениеДнейИНедель();
	КонецЕсли;
	
	// бэкдор
	Если РольДоступна("ПолныеПрава") Тогда 
		Элементы.ПланПродаж.ИзменятьСоставСтрок = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не(ЗначениеЗаполнено(Объект.ПериодПлана)) Тогда 
		СкрытьДни();
	КонецЕсли;	
	
	ОбновитьОтображениеПолейФормы();
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма, НомераДнейПоНеделям, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПланаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПериодПлана) Тогда 
		Объект.ПериодПлана = НачалоМесяца(Объект.ПериодПлана);		
		ОбновитьОтображениеДнейИНедель();
	Иначе
		СкрытьДни();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПродажПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПериодПлана) Тогда 
		ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма, НомераДнейПоНеделям, Истина);
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПланПродажПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.Имя = "ПланПродаж"
		И Элемент.ТекущиеДанные <> Неопределено Тогда 
		ИмяТекущегоЭлемента = Элемент.ТекущийЭлемент.Имя;
		
		Если ИмяТекущегоЭлемента = "ПланПродажСумма_Неделя_1" Тогда 
			СвернутьРазвернутьНеделю(1);
			Отказ = Истина;
		ИначеЕсли ИмяТекущегоЭлемента = "ПланПродажСумма_Неделя_2" Тогда 	
			СвернутьРазвернутьНеделю(2);	
			Отказ = Истина;
		ИначеЕсли ИмяТекущегоЭлемента = "ПланПродажСумма_Неделя_3" Тогда
			СвернутьРазвернутьНеделю(3);	
			Отказ = Истина;
		ИначеЕсли ИмяТекущегоЭлемента = "ПланПродажСумма_Неделя_4" Тогда
			СвернутьРазвернутьНеделю(4);	
			Отказ = Истина;
		ИначеЕсли ИмяТекущегоЭлемента = "ПланПродажСумма_Неделя_5" Тогда
			СвернутьРазвернутьНеделю(5);
			Отказ = Истина;
		ИначеЕсли ИмяТекущегоЭлемента = "ПланПродажСумма_Неделя_6" Тогда
			СвернутьРазвернутьНеделю(6);
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПериодыРаботыТорговыхТочекПриИзменении(Элемент)
	
	ОбновитьОтображениеПолейФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьСлужебныеРеквизитыПриИзменении(Элемент)
	
	ОбновитьОтображениеПолейФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	ДанныеВыбора			= Новый СписокЗначений();	
	
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ИТ_СтатусыПлановПродаж.НаПодготовке"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ИТ_СтатусыПлановПродаж.НаСогласовании"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПродажСуммаРаспределеноПриИзменении(Элемент)
	
	ТорговаяТочка		= ОпределитьРеквизитВыделеннойСтроки("ТорговаяТочка");	
	СуммаКРаспределению	= ОпределитьРеквизитВыделеннойСтроки("СуммаРаспределено");
	
	Если СуммаКРаспределению <> Неопределено Тогда 
		РаспределитьСуммыПланаСервер(ТорговаяТочка, СуммаКРаспределению);
		ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма, НомераДнейПоНеделям, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПланПродаж_ОбновитьПраваДоступа" Тогда 
		ОбновитьПраваДоступа();
		ОбновитьОтображениеПолейФормы();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Статус_НаСогласовании	= ПредопределенноеЗначение("Перечисление.ИТ_СтатусыПлановПродаж.НаСогласовании");
	Статус_Согласован		= ПредопределенноеЗначение("Перечисление.ИТ_СтатусыПлановПродаж.Согласован");
	
	Если Объект.Статус = Статус_НаСогласовании Тогда 
		Для Каждого СтрокаПланаПродаж Из Объект.ПланПродаж Цикл 
			Если СтрокаПланаПродаж.Статус <> Статус_Согласован Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"Перед отправкой документа на согласование необходимо согласовать все строки плана.",, 
					"Объект.ПланПродаж", 
					"Объект.ПланПродаж", 
					Отказ);
				Прервать;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПраваДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьОтображениеПолейФормы();	
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма, НомераДнейПоНеделям, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ЗаполнитьТорговыеТочки(Команда)
	
	ЗаполнитьТорговыеТочкиСервер();	
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма, НомераДнейПоНеделям, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммыПлана(Команда)
	
	ЗаполнитьСуммыПланаСервер();	
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма, НомераДнейПоНеделям, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСуммыПлана(Команда)
	
	РаспределитьСуммыПланаСервер();	
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма, НомераДнейПоНеделям, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоДаннымРаспределения(Команда)
	
	ОбновитьПоДаннымРаспределенияСервер();	
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма, НомераДнейПоНеделям, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммыПлана_ТекущаяСтрока(Команда)
	
	ТорговаяТочка = ОпределитьРеквизитВыделеннойСтроки("ТорговаяТочка");
	ЗаполнитьСуммыПланаСервер(ТорговаяТочка);	
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма, НомераДнейПоНеделям, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСуммыПлана_ТекущаяСтрока(Команда)
	
	ТорговаяТочка = ОпределитьРеквизитВыделеннойСтроки("ТорговаяТочка");	
	РаспределитьСуммыПланаСервер(ТорговаяТочка);
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма, НомераДнейПоНеделям, Истина);		
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоДаннымРаспределения_ТекущаяСтрока(Команда)
	
	ДокументРаспределения = ОпределитьРеквизитВыделеннойСтроки("ДокументРаспределения");
	ТорговыеТочкиДокументаРаспределения = Новый Массив();
	
	Если ДокументРаспределения <> Неопределено Тогда 
		СтрокиДокументаРаспределения = Объект.ПланПродаж.НайтиСтроки(Новый Структура("ДокументРаспределения", ДокументРаспределения));
		
		Для Каждого СтрокаДокументаРаспределения Из СтрокиДокументаРаспределения Цикл 
			ТорговыеТочкиДокументаРаспределения.Добавить(СтрокаДокументаРаспределения.ТорговаяТочка);			       	
		КонецЦикла;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТорговыеТочкиДокументаРаспределения) Тогда 
		ОбновитьПоДаннымРаспределенияСервер(ТорговыеТочкиДокументаРаспределения);	
		ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма, НомераДнейПоНеделям, Истина);	
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыРаспределения(Команда)
	
	Если Модифицированность Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед распределением необходимо записать документ.");
	Иначе	
		СоздатьДокументыРаспределенияНаСервере();
		ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма, НомераДнейПоНеделям, Истина);
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура Согласовать_ТекущаяСтрока(Команда)

	ДокументРаспределения = ОпределитьРеквизитВыделеннойСтроки("ДокументРаспределения");

	Если ЗначениеЗаполнено(ДокументРаспределения) Тогда 
		УстановитьСтатусДокументаРаспределения(ДокументРаспределения, ПредопределенноеЗначение("Перечисление.ИТ_СтатусыПлановПродаж.Согласован"));
		Оповестить("ПланПродаж_ОбновитьПраваДоступа");
		Записать();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НаПодготовку_ТекущаяСтрока(Команда)
	
	ДокументРаспределения = ОпределитьРеквизитВыделеннойСтроки("ДокументРаспределения");

	Если ЗначениеЗаполнено(ДокументРаспределения) Тогда
		ОтправитьДокументНаПодготовку(ДокументРаспределения);
		//УстановитьСтатусДокументаРаспределения(ДокументРаспределения, ПредопределенноеЗначение("Перечисление.ИТ_СтатусыПлановПродаж.НаПодготовке"));
		Оповестить("ПланПродаж_ОбновитьПраваДоступа");
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернуть_ВсеНедели(Команда)
	
	ЗначениеСвертки = Не(Элементы.ПланПродажСвернутьРазвернуть_ВсеНедели.Пометка);
	Элементы.ПланПродажСвернутьРазвернуть_ВсеНедели.Пометка = ЗначениеСвертки;
	
	Для НомерНедели = 1 По 6 Цикл 
		СвернутьРазвернутьНеделю(НомерНедели, ЗначениеСвертки);	
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура УпорядочитьТочки(Команда)
	
	УпорядочитьТочкиСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПраваДоступа()
	
	ПраваДоступа				= ИТ_ПланыПродаж.ПолучитьПраваДоступа("СтаршийМенеджер", Объект.Статус);
	РедактированиеДоступно		= ПраваДоступа.Редактирование;	
	СлужебныеРеквизитыДоступны	= ПраваДоступа.СлужебныеРеквизиты;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьОтображениеПолейФормы()
	
	Элементы.ПланПродажГруппаПериодыРаботыТорговыхТочек.Видимость	= ПоказыватьПериодыРаботыТорговыхТочек;
	Элементы.ОтображатьСлужебныеРеквизиты.Видимость					= СлужебныеРеквизитыДоступны;
	Элементы.ПланПродажГруппа_СлужебныеРеквизиты.Видимость			= ОтображатьСлужебныеРеквизиты;
	
	ЭтаФорма.ТолькоПросмотр = Не(РедактированиеДоступно);
	
	Элементы.ФормаОбновитьДанные.Доступность							= РедактированиеДоступно;
	Элементы.ФормаСоздатьДокументыРаспределения.Доступность				= РедактированиеДоступно;
	
	Элементы.ПланПродаж_ОбработкаПланаПродаж.Доступность				= РедактированиеДоступно;
	Элементы.ПланПродажЗаполнитьТорговыеТочки.Доступность				= РедактированиеДоступно;
	Элементы.ПланПродажЗаполнитьСуммыПлана.Доступность					= РедактированиеДоступно;
	Элементы.ПланПродажРаспределитьСуммыПлана.Доступность				= РедактированиеДоступно;
	
	Элементы.ПланПродаж_ОбработкаСтрокиПланаПродаж.Доступность			= РедактированиеДоступно;
	Элементы.ПланПродажЗаполнитьСуммыПлана_ТекущаяСтрока.Доступность	= РедактированиеДоступно;
	Элементы.ПланПродажРаспределитьСуммыПлана_ТекущаяСтрока.Доступность	= РедактированиеДоступно;
	
	Элементы.ПланПродажСогласовать_ТекущаяСтрока.Доступность			= РедактированиеДоступно;
	Элементы.ПланПродажНаПодготовку_ТекущаяСтрока.Доступность			= РедактированиеДоступно;
	
КонецПроцедуры	

&НаКлиенте
Процедура СвернутьРазвернутьНеделю(НомерНедели, ЗначениеСвертки = Неопределено)
	
	ИмяРеквизита		= "Свернута_Неделя_" + Формат(НомерНедели, "ЧДЦ=0; ЧН=0; ЧГ=0");
	НеделяСвернута		= ЭтаФорма[ИмяРеквизита];
	СтрокиДнейНедели	= НомераДнейПоНеделям.НайтиСтроки(Новый Структура("НомерНедели", НомерНедели));
	
	Для Каждого СтрокаДняНедели Из СтрокиДнейНедели Цикл 
		ИмяЭлементаДня = "ПланПродажСуммаДень_" + Формат(СтрокаДняНедели.НомерДня, "ЧДЦ=0; ЧН=0; ЧГ=0");
		
		Если ЗначениеСвертки = Неопределено Тогда 
			Элементы[ИмяЭлементаДня].Видимость = НеделяСвернута;	
		Иначе
			Элементы[ИмяЭлементаДня].Видимость = Не(ЗначениеСвертки);	
		КонецЕсли;
	КонецЦикла;	
	
	Если ЗначениеСвертки = Неопределено Тогда 
		ЭтаФорма[ИмяРеквизита] = Не(НеделяСвернута);
	Иначе
		ЭтаФорма[ИмяРеквизита] = ЗначениеСвертки;	
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура СкрытьДни()
	
	Для НомерДня = 1 По 31 Цикл 
		ИмяЭлемента = "ПланПродажСуммаДень_" + Формат(НомерДня, "ЧДЦ=0; ЧН=0; ЧГ=0");
		Элементы[ИмяЭлемента].Видимость = Ложь;		
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Функция ОпределитьРеквизитВыделеннойСтроки(ИмяРеквизита)
	
	ТекущиеДанные = Элементы.ПланПродаж.ТекущиеДанные;
	ЗначениеРеквизита = Неопределено;
	
	Если ТекущиеДанные = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выделена строка.",, "Объект.ПланПродаж");
	Иначе
		ЗначениеРеквизита = ТекущиеДанные[ИмяРеквизита];
		
		Если Не(ЗначениеЗаполнено(ЗначениеРеквизита)) Тогда 
			ТекстСообщения = СтрШаблон("Не заполнен реквизит %1.", ИмяРеквизита);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.ПланПродаж");
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ЗначениеРеквизита;
	
КонецФункции	

&НаСервере
Процедура ОбновитьОтображениеДнейИНедель()
	
	ПоследнийДень	= День(КонецМесяца(Объект.ПериодПлана));
	МесяцПлана		= Месяц(Объект.ПериодПлана);
	ГодПлана		= Год(Объект.ПериодПлана);
	НомерНедели		= 1;
	
	НомераДнейПоНеделям.Очистить();
	
	Для НомерДня = 1 По 31 Цикл 
		// Оформление дней
		Если НомерДня <= ПоследнийДень Тогда 
			ДатаДня				= Дата(ГодПлана, МесяцПлана, НомерДня);
			АктивностьДня		= Истина;
			ЗаголовокЭлемента	= Формат(ДатаДня, "ДФ='ддд"" / ""дд.ММ'");
		Иначе
			ДатаДня				= Дата(1, 1, 1);
			АктивностьДня		= Ложь;
			ЗаголовокЭлемента	= "Неактивен";	
		КонецЕсли;	
		
		ИмяЭлемента = "ПланПродажСуммаДень_" + Формат(НомерДня, "ЧДЦ=0; ЧН=0; ЧГ=0");
		Элементы[ИмяЭлемента].Видимость = АктивностьДня;		
		Элементы[ИмяЭлемента].Заголовок = ЗаголовокЭлемента;
		
		// Данные недель
		НомерДняПоНеделе = НомераДнейПоНеделям.Добавить();
		НомерДняПоНеделе.НомерНедели	= НомерНедели;
		НомерДняПоНеделе.НомерДня		= НомерДня;
		НомерДняПоНеделе.Дата			= ДатаДня;
		НомерДняПоНеделе.ДеньНедели		= ДеньНедели(ДатаДня);
		НомерДняПоНеделе.Активность		= АктивностьДня;
		
		Если НомерДняПоНеделе.ДеньНедели = 7 Тогда 
			НомерНедели = НомерНедели + 1;
		КонецЕсли;	
	КонецЦикла;	
	
	// Обновление отображения недель
	ЭлементПланПродаж = Элементы.ПланПродаж;
	
	Для НомерНедели = 1 По 6 Цикл 
		ИмяЭлемента		= "ПланПродажСумма_Неделя_" + Формат(НомерНедели, "ЧДЦ=0; ЧН=0; ЧГ=0");
		ЭлементНедели	= Элементы[ИмяЭлемента];
		СтрокиНомеров	= НомераДнейПоНеделям.НайтиСтроки(Новый Структура("НомерНедели", НомерНедели));
		
		Если СтрокиНомеров.Количество() = 0 Тогда 
			ЭлементНедели.Видимость = Ложь;
		Иначе
			ЭлементНедели.Видимость 	= Истина;
			ПервыйДень_Номер			= 31;
			ПервыйДень_ДеньНедели		= 8;
			ПервыйДень_Дата				= Неопределено;			
			ПоследнийДень_Номер			= 0;
			ПоследнийДень_ДеньНедели	= 0;
			ПоследнийДень_Дата			= Неопределено;			
			НеделяАктивна				= Ложь;
			
			Для Каждого СтрокаНомера Из СтрокиНомеров Цикл 
				Если СтрокаНомера.Активность Тогда 
					НеделяАктивна = Истина;
					
					Если СтрокаНомера.ДеньНедели < ПервыйДень_ДеньНедели Тогда 
						ПервыйДень_ДеньНедели	= СтрокаНомера.ДеньНедели; 
						ПервыйДень_Номер		= СтрокаНомера.НомерДня;
						ПервыйДень_Дата			= СтрокаНомера.Дата;
					КонецЕсли;	
					Если СтрокаНомера.ДеньНедели > ПоследнийДень_ДеньНедели Тогда 
						ПоследнийДень_ДеньНедели	= СтрокаНомера.ДеньНедели;
						ПоследнийДень_Номер			= СтрокаНомера.НомерДня;
						ПоследнийДень_Дата			= СтрокаНомера.Дата;
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;	
			
			Если НеделяАктивна Тогда 
				ЭлементНедели.Заголовок = СтрШаблон(
					"%1 - %2",
					Формат(ПервыйДень_Дата,		"ДФ=дд.ММ"),
					Формат(ПоследнийДень_Дата,	"ДФ=дд.ММ"));
					
				Если ПоследнийДень_Номер = 31 Тогда 	
					Элементы.Переместить(ЭлементНедели, ЭлементПланПродаж);
				Иначе
					ИмяЭлементаМестоположения	= "ПланПродажСуммаДень_" + Формат(ПоследнийДень_Номер + 1, "ЧДЦ=0; ЧН=0; ЧГ=0");
					ЭлементМестоположения		= Элементы[ИмяЭлементаМестоположения]; 
					Элементы.Переместить(ЭлементНедели, ЭлементПланПродаж, ЭлементМестоположения);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТорговыеТочкиСервер()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьТорговыеТочки();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммыПланаСервер(ТорговыеТочки = Неопределено)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьСуммыПланаПродаж(ТорговыеТочки);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
	ИТ_ПланыПродаж_КлиентСервер.ЗаполнитьДанныеПродажЗаПериод(Объект);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПериодаПрошлогоГода(ТорговыеТочки = Неопределено)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьСуммыФактаПрошлогоГода(ТорговыеТочки);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьСуммыПланаСервер(ТорговыеТочки = Неопределено, СуммаКРаспределению = 0)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РаспределитьСуммыПланаПродаж(ТорговыеТочки, СуммаКРаспределению);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
	ИТ_ПланыПродаж_КлиентСервер.ЗаполнитьДанныеПродажЗаПериод(Объект);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоДаннымРаспределенияСервер(ТорговыеТочки = Неопределено)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ОбновитьДанныеПоДочернимДокументам(ТорговыеТочки, Модифицированность);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	ИТ_ПланыПродаж_КлиентСервер.ЗаполнитьДанныеПродажЗаПериод(Объект);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыРаспределенияНаСервере()
	
	ИТ_ПланыПродаж.СоздатьДокументы_ПланПродаж_ЛМ(Объект.Ссылка);	
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ПривязатьДокументыРаспределения();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьДокументНаПодготовку(ДокументРаспределения)
	
	ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРаспределения, "ПометкаУдаления");
	
	Если ПометкаУдаления Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Документ линейного менеджера помечен на удаление. Операция отменена.");
		Возврат;
	КонецЕсли;	
	
	ДокументОбъект			= ДокументРаспределения.ПолучитьОбъект();
	ДокументОбъект.Статус	= Перечисления.ИТ_СтатусыПлановПродаж.НаПодготовке;
	ДокументПроведен		= Ложь;
	
	ДокументОбъект.ЗаполнитьСуммыПланаПродаж();
	ДокументОбъект.РаспределитьСуммыПланаПродаж();
	
	ИТ_ЛогированиеСервер.ЗаписатьПровестиДокумент(ДокументОбъект,,,,,,, РежимЗаписиДокумента.Проведение, ДокументПроведен);
	
	Если Не(ДокументПроведен) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Ошибка проведения документа. Обратитесь к администратору.");	
	Иначе
		СтрокиПланаПродаж = Объект.ПланПродаж.НайтиСтроки(Новый Структура("ДокументРаспределения", ДокументРаспределения));
		
		Для Каждого СтрокаПланаПродаж Из СтрокиПланаПродаж Цикл 
			СтрокаПланаПродаж.Статус = Перечисления.ИТ_СтатусыПлановПродаж.НаПодготовке;
		КонецЦикла;
		
		Записать();	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусДокументаРаспределения(ДокументРаспределения, Статус)
	
	Если ИТ_ПланыПродаж.УстановитьСтатусДокумента(ДокументРаспределения, Статус) Тогда 
		// Установка статусов строк
		СтрокиПланаПродаж = Объект.ПланПродаж.НайтиСтроки(Новый Структура("ДокументРаспределения", ДокументРаспределения));
		
		Для Каждого СтрокаПланаПродаж Из СтрокиПланаПродаж Цикл 
			СтрокаПланаПродаж.Статус = Статус;
		КонецЦикла;
		
		Записать();
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура УпорядочитьТочкиСервер()
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ПланПродаж
		|ИЗ
		|	&ПланПродаж КАК ПланПродаж
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	*
		|ИЗ
		|	ПланПродаж КАК ПланПродаж
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТорговаяТочка.ЛинейныйМенеджер.Наименование, ТорговаяТочка.Наименование";
		
	Запрос.УстановитьПараметр("ПланПродаж", Объект.ПланПродаж.Выгрузить());
	
	Результат = Запрос.Выполнить();
	Выгрузка = Результат.Выгрузить();
	
	Объект.ПланПродаж.Загрузить(Выгрузка);
	
КонецПроцедуры

#КонецОбласти
